## JOINs

**SQL Queries for Exercises on SQL JOINs**

### Connecting to the SQLite db file

In [1]:
# Importing library
import sqlite3

# Connect to or create the SQLite database

conn = sqlite3.connect('parch_and_posey.db')

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///parch_and_posey.db

**Pull all the data from the accounts table, and all the data from the orders table.**

<br>

**Pulling standard_qty, gloss_qty, and poster_qty from the orders table, and the website and the primary_poc from the accounts table.**

<br>

**Provide a table for all web_events associated with account name of Walmart. There should be three columns. Be sure to include the `primary_poc`, time of the event, and the `channel` for each event. Additionally, you might choose to add a fourth column to assure only Walmart events were chosen.**

In [4]:
%%sql

SELECT a.primary_poc, w.occurred_at, w.channel, a.name
FROM web_events w
JOIN accounts a
ON w.account_id = a.id
WHERE a.name = 'Walmart'
LIMIT 10;

 * sqlite:///parch_and_posey.db
Done.

[('Tamara Tuma', '2015-10-06 04:22:11', 'facebook', 'Walmart'),
 ('Tamara Tuma', '2015-10-06 17:13:58', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-10-22 05:02:47', 'organic', 'Walmart'),
 ('Tamara Tuma', '2015-10-22 14:04:20', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2015-11-05 03:08:26', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-11-05 17:18:54', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-12-04 03:57:24', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-12-11 08:44:16', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-01-01 15:45:54', 'adwords', 'Walmart'),
 ('Tamara Tuma', '2016-01-02 00:55:03', 'direct', 'Walmart')]

<br>

**Provide a table that provides the region for each `sales_rep` along with their associated accounts. Your final table should include three columns: the `region name`, the `sales rep name`, and the `account name`. Sort the accounts alphabetically (A-Z) according to account name.**

In [5]:
%%sql

SELECT r.name region, s.name rep, a.name account
FROM sales_reps s
JOIN region r
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
ORDER BY a.name
LIMIT 10;

 * sqlite:///parch_and_posey.db
Done.

[('Northeast', 'Sibyl Lauria', '3M'),
 ('Southeast', 'Earlie Schleusner', 'ADP'),
 ('Southeast', 'Moon Torian', 'AECOM'),
 ('Southeast', 'Calvin Ollison', 'AES'),
 ('Northeast', 'Elba Felder', 'AIG'),
 ('Northeast', 'Necole Victory', 'AT&T'),
 ('Midwest', 'Julie Starr', 'AbbVie'),
 ('Midwest', 'Chau Rowles', 'Abbott Laboratories'),
 ('West', 'Marquetta Laycock', 'Advance Auto Parts'),
 ('Northeast', 'Renetta Carew', 'Aetna')]

<br>

**Provide the name for each region for every order, as well as the account name and the unit price they paid (`total_amt_usd`/`total`) for the `order`. Your final table should have 3 columns: region name, account name, and unit price. A few `accounts` have 0 for `total`, so I divided by (total + 0.01) to assure not dividing by zero.**

In [6]:
%%sql

SELECT r.name region, a.name account, 
       o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
LIMIT 10;

 * sqlite:///parch_and_posey.db
Done.

[('Northeast', 'Walmart', 5.833423765599567),
 ('Northeast', 'Walmart', 5.879706082872509),
 ('Northeast', 'Walmart', 5.646522151667762),
 ('Northeast', 'Walmart', 5.935815147625161),
 ('Northeast', 'Walmart', 6.0194924371875205),
 ('Northeast', 'Walmart', 5.960184231258712),
 ('Northeast', 'Walmart', 5.759600023667239),
 ('Northeast', 'Walmart', 6.1687185711808565),
 ('Northeast', 'Walmart', 5.44423612294756),
 ('Northeast', 'Walmart', 6.033416662415183)]

<br>

**1. Provide a table that provides the `region` for each `sales_rep` along with their associated accounts. This time only for the `Midwest` region. Your final table should include three columns: the region name, the sales rep name, and the account name. Sort the accounts alphabetically (A-Z) according to account name.**

In [7]:
%%sql

SELECT r.name region, s.name rep, a.name account
FROM sales_reps s
JOIN region r
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
WHERE r.name = 'Midwest'
ORDER BY a.name
LIMIT 10;

 * sqlite:///parch_and_posey.db
Done.

[('Midwest', 'Julie Starr', 'AbbVie'),
 ('Midwest', 'Chau Rowles', 'Abbott Laboratories'),
 ('Midwest', 'Cliff Meints', 'Aflac'),
 ('Midwest', 'Chau Rowles', 'Alcoa'),
 ('Midwest', 'Charles Bidwell', 'Altria Group'),
 ('Midwest', 'Delilah Krum', 'Amgen'),
 ('Midwest', 'Charles Bidwell', 'Arrow Electronics'),
 ('Midwest', 'Delilah Krum', 'AutoNation'),
 ('Midwest', 'Delilah Krum', 'Capital One Financial'),
 ('Midwest', 'Cordell Rieder', 'Centene')]

<br>

**2. Provide a table that provides the `region` for each `sales_rep` along with their associated accounts. This time only for `accounts` where the sales rep has a first name starting with `S` and in the `Midwest` region. Your final table should include three columns: the region name, the sales rep name, and the account name. Sort the accounts alphabetically (A-Z) according to account name.**

In [8]:
%%sql

SELECT r.name region, s.name rep, a.name account
FROM sales_reps s
JOIN region r
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
WHERE r.name = 'Midwest' AND s.name LIKE 'S%'
ORDER BY a.name;

 * sqlite:///parch_and_posey.db
Done.

[('Midwest', 'Sherlene Wetherington', 'Community Health Systems'),
 ('Midwest', 'Sherlene Wetherington', 'Progressive'),
 ('Midwest', 'Sherlene Wetherington', 'Rite Aid'),
 ('Midwest', 'Sherlene Wetherington', 'Time Warner Cable'),
 ('Midwest', 'Sherlene Wetherington', 'U.S. Bancorp')]

<br>

**3. Provide a table that provides the `region` for each `sales_rep` along with their associated `accounts`. This time only for accounts where the sales rep has a last name starting with K and in the `Midwest` region. Your final table should include three columns: the region name, the sales rep name, and the account name. Sort the accounts alphabetically (A-Z) according to account name.**

In [9]:
%%sql

SELECT r.name region, s.name rep, a.name account
FROM sales_reps s
JOIN region r
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
WHERE r.name = 'Midwest' AND s.name LIKE '% K%'
ORDER BY a.name;

 * sqlite:///parch_and_posey.db
Done.

[('Midwest', 'Delilah Krum', 'Amgen'),
 ('Midwest', 'Delilah Krum', 'AutoNation'),
 ('Midwest', 'Delilah Krum', 'Capital One Financial'),
 ('Midwest', 'Delilah Krum', 'Cummins'),
 ('Midwest', 'Carletta Kosinski', 'Danaher'),
 ('Midwest', 'Carletta Kosinski', 'Dollar General'),
 ('Midwest', 'Delilah Krum', 'Hartford Financial Services Group'),
 ('Midwest', 'Carletta Kosinski', 'International Paper'),
 ('Midwest', 'Delilah Krum', 'Kimberly-Clark'),
 ('Midwest', 'Carletta Kosinski', "McDonald's"),
 ('Midwest', 'Carletta Kosinski', 'Northrop Grumman'),
 ('Midwest', 'Delilah Krum', 'Plains GP Holdings'),
 ('Midwest', 'Delilah Krum', 'Southwest Airlines')]

<br>

**4. Provide the name for each `region` for every order, as well as the account name and the unit price they paid (total_amt_usd/total) for the order. However, you should only provide the results if the standard order quantity exceeds `100`. Your final table should have 3 columns: region name, account name, and unit price. In order to avoid a division by zero error, adding .01 to the denominator here is helpful total_amt_usd/(total+0.01).**

In [10]:
%%sql

SELECT r.name region, a.name account, o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
WHERE o.standard_qty > 100
LIMIT 10;

 * sqlite:///parch_and_posey.db
Done.

[('Northeast', 'Walmart', 5.759600023667239),
 ('Northeast', 'Walmart', 5.965174820318739),
 ('Northeast', 'Walmart', 5.44423612294756),
 ('Northeast', 'Walmart', 5.960184231258712),
 ('Northeast', 'Walmart', 6.1687185711808565),
 ('Northeast', 'Walmart', 6.628910225211274),
 ('Northeast', 'Walmart', 5.646522151667762),
 ('Northeast', 'Walmart', 6.033416662415183),
 ('Northeast', 'Walmart', 6.0194924371875205),
 ('Northeast', 'Walmart', 6.10980429503357)]

<br>

**5. Provide the `name` for each `region` for every order, as well as the account name and the unit price they paid (`total_amt_usd`/`total`) for the order. However, you should only provide the results if the `standard order quantity` exceeds 100 and the `poster order quantity` exceeds 50. Your final table should have 3 columns: `region name`, `account name`, and `unit price`. Sort for the smallest unit price first. In order to avoid a division by zero error, adding .01 to the denominator here is helpful (`total_amt_usd`/(`total`+0.01).**

In [11]:
%%sql

SELECT r.name region, a.name account, o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
WHERE o.standard_qty > 100 AND o.poster_qty > 50
ORDER BY unit_price
LIMIT 10;

 * sqlite:///parch_and_posey.db
Done.

[('Northeast', 'State Farm Insurance Cos.', 5.119282250254291),
 ('Southeast', 'DISH Network', 5.231815847540363),
 ('Northeast', 'Travelers Cos.', 5.2351813313106526),
 ('Northeast', 'Best Buy', 5.260426437930026),
 ('West', 'Stanley Black & Decker', 5.266395560073999),
 ('Northeast', 'Citigroup', 5.273081210319704),
 ('Southeast', 'BlackRock', 5.2782700457278775),
 ('Southeast', 'Nucor', 5.2890939504788514),
 ('Northeast', 'Merck', 5.29639144152687),
 ('Midwest', 'Sears Holdings', 5.3009122462935965)]

<br>

**6. Provide the name for each `region` for every `order`, as well as the account name and the unit price they paid (`total_amt_usd`/`total`) for the `order`. However, you should only provide the results if the standard order quantity exceeds 100 and the poster order quantity exceeds 50. Your final table should have 3 columns: `region name`, account name, and `unit price`. Sort for the largest unit price first. In order to avoid a division by zero error, adding .01 to the denominator here is helpful (`total_amt_usd`/(`total`+0.01).**

In [12]:
%%sql

SELECT r.name region, a.name account, o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
JOIN sales_reps s
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
JOIN orders o
ON o.account_id = a.id
WHERE o.standard_qty > 100 AND o.poster_qty > 50
ORDER BY unit_price DESC
LIMIT 10;

 * sqlite:///parch_and_posey.db
Done.

[('Northeast', 'IBM', 8.089906082278144),
 ('West', 'Mosaic', 8.066329210358129),
 ('West', 'Pacific Life', 8.063022652514793),
 ('Northeast', 'CHS', 8.018849326780114),
 ('West', 'Fidelity National Financial', 7.9928024668468325),
 ('Midwest', 'Paccar', 7.986961758718576),
 ('Southeast', 'PNC Financial Services Group', 7.8951386043342335),
 ('Northeast', 'Costco', 7.789351900293272),
 ('Midwest', 'Amgen', 7.75383130334812),
 ('West', 'Hormel Foods', 7.747530071148978)]

<br>

**7. What are the different `channel`s used by `account id` `1001`? Your final table should have only 2 columns: `account name` and the different `channels`. You can try `SELECT` `DISTINCT` to narrow down the results to only the unique values.**

In [13]:
%%sql

SELECT DISTINCT a.name, w.channel
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
WHERE a.id = '1001';

 * sqlite:///parch_and_posey.db
Done.

[('Walmart', 'adwords'),
 ('Walmart', 'banner'),
 ('Walmart', 'direct'),
 ('Walmart', 'facebook'),
 ('Walmart', 'organic'),
 ('Walmart', 'twitter')]

<br>

**8. Find all the orders that occurred in 2015. Your final table should have 4 columns: `occurred_at`, `account name`, `order total`, and `order total_amt_usd`.**

In [14]:
%%sql

SELECT r.name region, s.name rep, a.name account
FROM sales_reps s
JOIN region r
ON s.region_id = r.id
JOIN accounts a
ON a.sales_rep_id = s.id
WHERE r.name = 'Midwest' AND s.name LIKE 'S%'
ORDER BY a.name;

 * sqlite:///parch_and_posey.db
Done.

[('Midwest', 'Sherlene Wetherington', 'Community Health Systems'),
 ('Midwest', 'Sherlene Wetherington', 'Progressive'),
 ('Midwest', 'Sherlene Wetherington', 'Rite Aid'),
 ('Midwest', 'Sherlene Wetherington', 'Time Warner Cable'),
 ('Midwest', 'Sherlene Wetherington', 'U.S. Bancorp')]